index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-17 Sat 12:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Error Correction Models</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Error Correction Models</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4ee22ab">1. 1 vs 2 Month Crude Oil Futures</a></li>
</ul>
</div>
</div>
<p>
We'll get the data from the FRED API using the <code>quantmod</code> R package, and then we'll estimate error-correction models in both Python and R.  For some reason the python package to access FRED (<code>fredapi</code>) requires an API key whereas <code>quantmod</code> does not.  
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff995e;">library</span>(quantmod)
<span style="color: #ff995e;">library</span>(tseries)
<span style="color: #ff995e;">library</span>(EIAdata)
</pre>
</div>


<div id="outline-container-org4ee22ab" class="outline-2">
<h2 id="org4ee22ab"><span class="section-number-2">1.</span> 1 vs 2 Month Crude Oil Futures</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-R">key <span style="color: #ff995e;">&lt;-</span> <span style="color: #ff995e;">source</span>(<span style="color: #c3e88d;">"~/eia_key"</span>)$value
one_month <span style="color: #ff995e;">&lt;-</span> getEIA(<span style="color: #c3e88d;">'PET.RCLC1.W'</span>, key = key)
two_month <span style="color: #ff995e;">&lt;-</span> getEIA(<span style="color: #c3e88d;">'PET.RCLC2.W'</span>, key = key)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">oil_data <span style="color: #ff995e;">&lt;-</span> merge.xts(one_month, two_month, join=<span style="color: #c3e88d;">"inner"</span>)
oil_spurious_reg <span style="color: #ff995e;">&lt;-</span> lm(I(log(oil_data$PET.RCLC2.W)) ~ I(log(oil_data$PET.RCLC1.W)))
summary(oil_spurious_reg)
</pre>
</div>

<pre class="example" id="orgf74b7ff">

Call:
lm(formula = I(log(oil_data$PET.RCLC2.W)) ~ I(log(oil_data$PET.RCLC1.W)))

Residuals:
     Min       1Q   Median       3Q      Max 
-0.12913 -0.01096  0.00131  0.00853  1.58039 

Coefficients:
                             Estimate Std. Error t value Pr(&gt;|t|)    
(Intercept)                  0.002357   0.005397   0.437    0.662    
I(log(oil_data$PET.RCLC1.W)) 0.999474   0.001473 678.355   &lt;2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.04251 on 1965 degrees of freedom
Multiple R-squared:  0.9957,	Adjusted R-squared:  0.9957 
F-statistic: 4.602e+05 on 1 and 1965 DF,  p-value: &lt; 2.2e-16
</pre>

<div class="org-src-container">
<pre class="src src-R">adf.test(oil_spurious_reg$resid)
</pre>
</div>

<pre class="example">

	Augmented Dickey-Fuller Test

data:  oil_spurious_reg$resid
Dickey-Fuller = -9.0417, Lag order = 12, p-value = 0.01
alternative hypothesis: stationary

Warning message:
In adf.test(oil_spurious_reg$resid) : p-value smaller than printed p-value
</pre>


<p>
We can reject the null of a unit root in the residuals, which is evidence that the two series are cointegrated.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-09-17 Sat 12:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
